<?php

return [
    'general_errors' => [
        'validation' => 'در اعتبار سنجی داده های شما خطایی رخ داده است.',
        'authorization' => 'شما دسترسی لازم برای مشاهده ی این بخش را ندارید.',
        'urlNotFound' => 'آدرس ورودی معتبر نیست.',
        'recordNotFound' => 'رکورد مورد نظر یافت نشد',
        'server' => 'خطایی سمت سرور رخ داده است.',
        'unknown' => 'خطای نامشخص سمت سرور رخ داده است.',
        'unauthorized' => 'برای مشاهده ی این بخش ابتدا وارد شوید.',
    ],
    'auth' => [
        'loginError' => 'شناسه یا رمزعبور وارد شده معتبر نیست.',
        'loginSuccess' => 'شما با موفقیت وارد شدید.',
        'logoutSuccess' => 'شما با موفقیت خارج شدید.',
        'dataSuccess' => 'عملیات با موفقیت انجام شد.',
    ],
    'records' => [
        'getSuccess' => 'عملیات با موفقیت انجام شد.',
        'addSuccess' => 'عملیات با موفقیت انجام شد.',
        'addFailed' => 'در ذخیره اطلاعات خطایی رخ داده است.',
        'editSuccess' => 'عملیات با موفقیت انجام شد.',
        'editFailed' => 'در ذخیره اطلاعات خطایی رخ داده است.',
        'deleteSuccess' => 'عملیات با موفقیت انجام شد.',
        'deleteFailed' => 'در هنگام حذف اطلاعات خطایی رخ داده است.',
    ],

    'otp' => [
        'pattern' => 'کد فعال سازی شماره ی شما در فروشگاه لیان : :code',
        'blocked' => 'تعداد دفعات تلاش برای دریافت کد ۵ عدد میباشد. لطفا مجددا پس از 15 دقیقه تلاش کنید.',
        'success' => 'کد فعال سازی به موبایل شما ارسال شد.',
        'error' => 'در ارسال کدفعالسازی خطایی رخ داده است.',
        'wrong' => 'کد وارد شده معتبر نیست.',
    ]
];
